In [1]:
import pandas as pd

creating a dataframe

In [2]:
#1. From a dictionary of lists
data = {
    'name': ['gokul', 'vatsa', 'chatrapathi'],
    'age': [17, 16, 17],
    'place': ['kadapa', 'kurnool', 'kurnool']
}
df = pd.DataFrame(data)
df

          name  age    place
0        gokul   17   kadapa
1        vatsa   16  kurnool
2  chatrapathi   17  kurnool

2. custom row index

In [4]:
df = pd.DataFrame(data, index=['a', 'b', 'c'])
df

          name  age    place
a        gokul   17   kadapa
b        vatsa   16  kurnool
c  chatrapathi   17  kurnool

Accessing data in dataframe

In [6]:
print(df['name'])
print(df[['name', 'age']])

a          gokul
b          vatsa
c    chatrapathi
Name: name, dtype: object
          name  age
a        gokul   17
b        vatsa   16
c  chatrapathi   17

In [8]:
print(df.loc['a'])
print(df.iloc[0])

name      gokul
age          17
place    kadapa
Name: a, dtype: object
name      gokul
age          17
place    kadapa
Name: a, dtype: object

basic info functions

In [10]:
info = pd.DataFrame({
    'method': ['df.shape', 'df.info()', 'df.describe()'],
    'def': ['(rows, columns)', 'summary of dataframe', 'summary for numeric stats']
})
info

          method                        def
0       df.shape            (rows, columns)
1      df.info()       summary of dataframe
2  df.describe()  summary for numeric stats